# - @2026 | Version 4.0
# - Created By: T.me/sii_3
# - Mr Dark

# ~ Agent DarkPs Official [>_]

from __future__ import annotations


def бан() -> None:
    from .dark import цв, сж, с35, с90, с1, с80, с22, с23, с24, с51, сб

    print(
        цв('вы можете изменить личность ', с80+с1) +
        цв('"Ps"', с22+с1) +
        цв(' фаиле ', с80+с1) +
        цв('"identity.md"', с23+с1) +
        цв('', с80+с1)
    )

    print(
        цв('- поддержать ', с80+с1) +
        цв('dark.ps', с51+с1)
    )

    print(
        цв('не забудьте скачать шрифт ', с80+с1) +
        цв('"agent/Line.md"', с24+с1)
    )
    print()
    print(цв('╭──────────────────────────────────────╮', с51+с1))
    print(
        цв('│', с51+с1) +
        цв('            Ps Agent v4.0             ', '') +
        цв('│', с51+с1)
    )
    print(
        цв('│', с51+с1) +
        цв('  Create By: t.me/sii_3  - Dark :)    ', с35+с1) +
        цв('│', с51+с1)
    )
    print(
        цв('│', с51+с1) +
        цв('         Telegram: @darku1 ', с1+с90) +
        цв(chr(0xf1d8), с1+сб) +
        цв('          ', с1+с90) +
        цв('│', с51+с1)
    )
    print(цв('╰──────────────────────────────────────╯', с51+с1))
    
# - By: T.me/sii_3